tests/darcy_05/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  11
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application       foamRun;

solver            darcy;

startFrom         latestTime;

startTime         0;

stopAt            endTime;

endTime           50;

deltaT            0.1;

writeControl      adjustableRunTime;

writeInterval     1;

purgeWrite        0;

writeFormat       ascii;

writePrecision    12;

writeCompression  off;

timeFormat        general;

timePrecision     12;

runTimeModifiable true;

adjustTimeStep  yes;

maxCo           1;

maxDeltaT       1;

// ************************************************************************* //
