tests/darcy_05/0/C.tracer.orig
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  dev
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0";
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -3 0 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    top
    {
        type            empty;
    }
    bottom
    {
        type            empty;
    }
    frontAndBack
    {
        type            empty;
    }
    right
    {
        type            zeroGradient;
    }
    left
    {
        type            fixedValue;
        value           uniform 0.1;
    }
}

// ************************************************************************* //

